import { Text } from '@chakra-ui/react'
import React from 'react'
import Footer from '../Footer'

export default function Agrichistory() {
  return (
    <>
      <div className="flex items-center justify-center">
        <div className=" w-9/12 text-center  ">
          <Text
            color="black"
            as="u"
            fontSize="xx-large"
            align="center"
            justifyContent="center"
          >
            AGRIC
          </Text>
          <div className="grid text-start">
            <Text as="b" fontSize="2xl">
              ประวัติความเป็นมาของ AGRIC
            </Text>
            <Text className="mb-3 mt-3">
              เริ่มต้นในปี 2024, AGRIC
              ได้ถูกสร้างขึ้นเพื่อเป็นที่รวบรวมและแบ่งปันประสบการณ์ของผู้ใช้
            </Text>
            <Text as="b" fontSize="2xl">
              จุดเริ่มต้นของเรา
            </Text>
            <Text className="mb-3 mt-3">
              เราพบว่าชุมชนที่ได้ไปนั้น มีความพิเศษและเป็นเอกลักษณ์
              แต่ก็มีปัญหาและความต้องการที่ต้องการแก้ไขและความร่วมมือต่างๆ
              ด้วยปัญหาในชีวิตประจำวัน วัฒนธรรมต่างๆที่คุ้นเคย
              และสินค้าที่มีคุณค่าตามท้องถิ่น
              แต่สิ่งทั้งหมดเหล่านี้ก็ยังเป็นที่มาของเรื่องราวที่น่าสนใจ
            </Text>
            <br />
            <Text className="mb-3 mt-3">
              เราหวังว่าจะได้แบ่งปันประสบการณ์ที่ดี ปัญหาที่พบเจอ
              ให้ทุกคนได้ร่วมช่วยกันแก้ไขและสร้างความสัมพันธ์ที่ดีต่อกัน
              และสิ่งที่ทุกคนสามารถได้เรียนรู้โดยผ่านเว็บไซต์นี้
              ร่วมถึงการต่อยอดในเชิงธุรกิจของผู้ประกอบการต่างๆ
              การสร้างกิจกรรมที่สร้างจิตสำนึกของผู้คน
              การสร้างแคมเปญที่ดีต่อสังคม และการยกระดับสินค้าในชุมชน
            </Text>
            <br />
            <Text className="mb-3 mt-3">
              โดยการกระทำเช่นนี้เราหวังว่า
              เว็บไซต์ของเราจะเป็นแหล่งเรียนรู้ข้อมูลที่ครบถ้วนและมีคุณค่าที่ช่วยเสริมสร้างชุมชนที่ได้ช่วยเหลือซึ่งกันและกัน
              ให้ทุกคนได้เจอเรื่องราวที่ดี ที่น่าสนใจ
              แล้วต้องลุกออกไปทำให้สำเร็จให้ได้ในสิ่งที่อยากทำ
              กลัวการที่ต้องทำด้วยตัวคนเดียวในการเริ่มต้น แต่จะไม่ต้องกลัว
              เพราะจะมีคนที่ต้องการทำร่วมกับเรา ในสิ่งที่เราอยากทำ
              ไม่ว่าจะเล็กหรือใหญ่ คนมากหรือน้อย
              และยังเป็นจุดที่ทุกคนจะได้พบเจอกัน
              ได้มีส่วนร่วมกันทำในสิ่งที่ต้องการ ได้เจออะไรใหม่ๆ วิถีชีวิต
              ความเป็นอยู่ของชุมชนไม่ว่าจะเล็กหรือใหญ่ การได้แบ่งปัน
              การแชร์เรื่องราวดีๆ การได้เล่า การได้บอกต่อ
              การได้ต่อยอดให้ดีกว่าเดิม การช่วยเหลือ เราหวังว่าเว็บไซต์ของเรา
              จะเป็นมิตรกับทุกคนที่ได้เข้ามาใช้งาน
            </Text>
          </div>
        </div>
      </div>
    </>
  )
}
