import { Text } from '@chakra-ui/react'
import { Button, Divider, Textarea } from '@nextui-org/react'
import React from 'react'
import Image from 'next/image'
import { Input } from '@nextui-org/react'
import { getCurrentUser } from '@/lib/session'
import Link from 'next/link'

export default async function Policy() {
  const user = await getCurrentUser()
  return (
    <div className="flex items-center justify-center ">
      <div className=" w-9/12 text-center  ">
        <Text
          color="black"
          as="u"
          fontSize="xx-large"
          align="center"
          justifyContent="center"
        >
          AGRIC
        </Text>

        <div className="grid text-start">
          <Text as="b" color="black" fontSize="2xl">
            นโยบายความเป็นส่วนตัว
          </Text>

          <Text className="mb-3 mt-3">ยินดีต้อนรับทุกท่านเข้าสุ่AGRIC</Text>
          <Text>
            ที่นี้เรามุ่งมั่นที่จะปกป้องความเป็นส่วนตัวของคุณอย่างสูงสุด
            เราขอแสดงความเคารพและใส่ใจถึงข้อมูลส่วนบุคคลของทุกท่านที่เราได้รับมอบหมาย
            การนําข้อมูลส่วนบุคคลของท่านไปใช้จะเป็นไปตามนโยบายความเป็นส่วนตัวนี้
            กรุณาอ่านและทำความเข้าใจนโยบายนี้ก่อนที่จะให้ข้อมูลส่วนบุคคลของท่าน
          </Text>
          <br />

          <Text fontSize="2xl" color="black" className="mb-3 mt-3" as="b">
            นโยบายความเป็นส่วนตัว คืออะไร ?
          </Text>
          <Text>
            นโยบายส่วนตัวคือเอกสารที่ระบุถึงวิธีการรวบรวม, ใช้, เก็บรักษา,
            เปิดเผย,
            และปกป้องข้อมูลส่วนบุคคลของบุคคลที่เกี่ยวข้องกับบริการหรือผลิตภัณฑ์ใดๆ
            ที่มีการให้บริการโดยบริษัทหรือองค์กรใด ๆ
            ทั้งนี้เพื่อให้ผู้ใช้งานทราบถึงว่าข้อมูลส่วนบุคคลของพวกเขาจะถูกจัดการอย่างไร
            และมีวัตถุประสงค์หลักในการใช้ข้อมูลนั้นๆ
            เพื่อปกป้องความเป็นส่วนตัวและความปลอดภัยของผู้ใช้งาน
          </Text>

          <div className="mt-10 flex flex-col space-y-4">
            <Text fontSize="large" as="b" color="black">
              นโยบายส่วนตัวมักมีรายละเอียดเกี่ยวกับ
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.ข้อมูลที่รวบรวม
            </Text>
            <Text className="">
              ระบุประเภทของข้อมูลที่จะถูกรวบรวม เช่น ชื่อ, ที่อยู่, อีเมล,
              ข้อมูลการใช้งาน, ฯลฯ
            </Text>

            <Text className="mt-3" color="black">
              2.วัตถุประสงค์ในการใช้ข้อมูล
            </Text>
            <Text className="">
              อธิบายว่าทำไมต้องรวบรวมข้อมูลนั้น ๆ และใช้เพื่อวัตถุประสงค์อะไร
              เช่น ให้บริการ, ปรับปรุงคุณภาพ, ฯลฯ
            </Text>

            <Text className="mt-3" color="black">
              3.วิธีการรักษาความปลอดภัยของข้อมูล
            </Text>
            <Text className="">
              อธิบายมาตรการที่ถูกนำเข้าใช้เพื่อปกป้องข้อมูลส่วนบุคคล
            </Text>

            <Text className="mt-3" color="black">
              4.การเข้าถึงข้อมูล
            </Text>
            <Text className="">
              ระบุว่าใครมีสิทธิ์เข้าถึงข้อมูล
              และจะมีการเปิดเผยข้อมูลให้กับบุคคลภายนอกหรือไม่
            </Text>

            <Text className="mt-3" color="black">
              5.การเก็บรักษาข้อมูล
            </Text>
            <Text className="">
              ระบุระยะเวลาที่ข้อมูลส่วนบุคคลจะถูกเก็บรักษา
            </Text>

            <Text className="mt-3" color="black">
              6.การเปิดเผยข้อมูล
            </Text>
            <Text className="">
              บอกถึงกรณีฉุกเฉินหรือสถานการณ์ที่จำเป็นที่จะต้องเปิดเผยข้อมูล
            </Text>

            <Text className="mt-3" color="black">
              7.สิทธิของผู้ใช้งาน
            </Text>
            <Text className="">
              อธิบายสิทธิและตัวเลือกที่ผู้ใช้งานมีในการควบคุมข้อมูลส่วนบุคคลของตนเอง
            </Text>

            <Text className="mt-3" color="black">
              การทำนโยบายส่วนตัวมีไว้เพื่อให้ผู้ใช้งานเข้าใจและมีความมั่นใจในการให้ข้อมูลส่วนบุคคลเราควรที่จะทำความเข้าใจนโยบายส่วนตัวของเว็บไซต์หรือแพลตฟอร์มที่เราใช้บริการ
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              ข้อมูลส่วนบุคคลที่เรารวบรวม
            </Text>

            <Text>
              เราจะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อให้บริการและปรับปรุงคุณภาพของแพลตฟอร์มเรา
              ข้อมูลที่เรารวบรวมอาจรวมถึง แต่ไม่จำกัดเพียงชื่อ, ที่อยู่, อีเมล,
              และข้อมูลการใช้งานของท่านในแพลตฟอร์ม
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.ข้อมูลส่วนบุคคล
            </Text>
            <Text className="">
              เก็บข้อมูลส่วนบุคคลเท่าที่จำเป็น เช่น ชื่อ, ที่อยู่, อีเมล,
              เบอร์โทรศัพท์ เพื่อการติดต่อและให้บริการ
            </Text>

            <Text className="mt-3" color="black">
              2.ข้อมูลการใช้งาน
            </Text>
            <Text className="">
              รวบรวมข้อมูลเกี่ยวกับวิธีการใช้งานแพลตฟอร์ม
              เพื่อปรับปรุงประสิทธิภาพและประสบการณ์ของผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              3.ข้อมูลที่ทำให้ระบุตัวตน
            </Text>
            <Text className="">
              การเก็บข้อมูลที่ทำให้ระบุตัวตนควรถูกจำกัดและปกป้องอย่างมีความปลอดภัย
            </Text>

            <Text className="mt-3" color="black">
              4.ข้อมูลการเข้าถึง
            </Text>
            <Text className="">
              บันทึกข้อมูลเกี่ยวกับการเข้าถึงและใช้งานแพลตฟอร์ม,
              เพื่อวิเคราะห์และปรับปรุงประสิทธิภาพ
            </Text>

            <Text className="mt-3" color="black">
              5.ข้อมูลติดตามและคุกกี้
            </Text>
            <Text className="">
              การใช้คุกกี้และเทคโนโลยีติดตามเพื่อทำให้การใช้งานเว็บไซต์มีประสิทธิภาพมากยิ่งขึ้น
            </Text>

            <Text className="mt-3" color="black">
              6.ข้อมูลการตลาดและโฆษณา
            </Text>
            <Text className="">
              บันทึกข้อมูลการตลาดเพื่อปรับปรุงกิจกรรมการโฆษณาและการตลาด
            </Text>

            <Text className="mt-3" color="black">
              7.ข้อมูลการสนับสนุน
            </Text>
            <Text className="">
              หากมีบริการการสนับสนุน,
              ควรเก็บข้อมูลที่เกี่ยวข้องกับการช่วยเหลือและแก้ไขปัญหา
            </Text>

            <Text className="mt-3" color="black">
              8.ข้อมูลการเปิดเผย
            </Text>
            <Text className="">
              ระบุว่าแพลตฟอร์มจะเปิดเผยข้อมูลกับบุคคลภายนอกหรือไม่,
              และถ้าเปิดเผย, จะมีมาตรการความปลอดภัยอย่างไร
            </Text>

            <Text className="mt-3" color="black">
              9.ข้อมูลการปฏิเส
            </Text>
            <Text className="">
              ระบุการที่ผู้ใช้งานสามารถปฏิเสธการเก็บข้อมูลหรือปรับแก้การตั้งค่าความเป็นส่วนตัว
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              วัตถุประสงค์ของการใช้ข้อมูล
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.การให้บริการ
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อจัดการและให้บริการแพลตฟอร์มในลักษณะที่เต็มที่และตอบสนองต่อความต้องการของผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              2.ปรับปรุงประสิทธิภาพ
            </Text>
            <Text className="">
              การศึกษาและการอบรมการใช้งานเพื่อปรับปรุงประสิทธิภาพและประสบการณ์ของผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              3.ความปลอดภัยและการดูแล
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อรักษาความปลอดภัยของแพลตฟอร์มและข้อมูลที่ถูกรวบรวม,
              รวมถึงการตรวจสอบและป้องกันการใช้งานที่ไม่ถูกต้อง
            </Text>

            <Text className="mt-3" color="black">
              4.พัฒนาฟีเจอร์ใหม
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อพัฒนาและเพิ่มเติมฟีเจอร์ใหม่ที่สามารถตอบสนองต่อความต้องการและความสะดวกสบายของผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              5.การตลาดและโฆษณา
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อปรับปรุงกิจกรรมการตลาดและโฆษณาให้เหมาะสมและน่าสนใจต่อกลุ่มเป้าหมาย
            </Text>

            <Text className="mt-3" color="black">
              6.การวิเคราะห์ข้อมูล
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อทำการวิเคราะห์เพิ่มเติมเพื่อเข้าใจแนวโน้ม,
              พฤติกรรมของผู้ใช้, และข้อมูลที่มีประโยชน์
            </Text>

            <Text className="mt-3" color="black">
              7.การบริหารจัดการผู้ใช้
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อการบริหารจัดการและสร้างความสัมพันธ์ที่ดีกับผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              8.การพัฒนาในทางธุรกิจ
            </Text>
            <Text className="">
              ใช้ข้อมูลเพื่อนำเสนอโอกาสทางธุรกิจ, การต่อยอด,
              และการพัฒนาในทางที่มีประสิทธิภาพ
            </Text>

            <Text className="mt-3" color="black">
              การใช้ข้อมูลทั้งหมดนี้เกิดขึ้นเพื่อให้แพลตฟอร์มมีประสิทธิภาพ
              ความปลอดภัย และความน่าสนใจต่อผู้ใช้งาน
              ตลอดจนเพื่อสร้างคุณค่าและประโยชน์ที่ดีที่สุดสำหรับผู้ใช้ของแพลตฟอร์มนี้
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              วิธีการรักษาความปลอดภัยของข้อมูล
            </Text>

            <Text>
              การรักษาความปลอดภัยของข้อมูลเป็นเรื่องสำคัญที่สำหรับแพลตฟอร์มใดๆ
              โดยเฉพาะในทางธุรกิจที่จัดเก็บข้อมูลส่วนบุคคล.
              นี่คือขั้นตอนการรักษาความปลอดภัยขั้นพื้นฐานที่สามารถนำไปปฏิบัติได้
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.การเข้ารหัสข้อมูล
            </Text>
            <Text className="">
              ใช้เทคนิคการเข้ารหัสเพื่อป้องกันข้อมูลที่ถูกรับรองเข้าถึงโดยไม่ได้รับอนุญาต.
              การใช้ HTTPS สำหรับการสื่อสารข้อมูลระหว่างเว็บและผู้ใช้เป็นต้น.
            </Text>

            <Text className="mt-3" color="black">
              2.การป้องกันการเข้าถึงไม่ถูกต้อง
            </Text>
            <Text className="">
              ใช้การตรวจสอบการเข้าถึงและให้สิทธิ์เฉพาะในการเข้าถึงข้อมูล.
              ปรับปรุงระบบการรับรองตัวตนและการควบคุมการเข้าถึง
            </Text>

            <Text className="mt-3" color="black">
              3.การสำรองข้อมูล
            </Text>
            <Text className="">
              ปฏิบัติการสำรองข้อมูลเป็นระยะเวลา.
              นำข้อมูลไปเก็บที่สถานที่ปลอดภัยที่แยกจากระบบหลัก.
            </Text>

            <Text className="mt-3" color="black">
              4.การป้องกันไมโครเชฟท์และมัลแวร์
            </Text>
            <Text className="">
              ใช้ซอฟต์แวร์ป้องกันไวรัสและซอฟต์แวร์ป้องกันไมโครเชฟท์เพื่อป้องกันไมโครเชฟท์และมัลแวร์ที่อาจเข้ามาทำลายข้อมูล.
            </Text>

            <Text className="mt-3" color="black">
              5.การอัปเดตระบบ
            </Text>
            <Text className="">
              ทำการอัปเดตระบบปฏิบัติการ, ซอฟต์แวร์,
              และฟีเจอร์ความปลอดภัยอย่างสม่ำเสมอ.
            </Text>

            <Text className="mt-3" color="black">
              6.การศึกษาและการอบรม
            </Text>
            <Text className="">
              สอนพนักงานเกี่ยวกับการรักษาความปลอดภัยและการปฏิบัติที่ถูกต้อง.
            </Text>

            <Text className="mt-3" color="black">
              7.นโยบายความปลอดภัย
            </Text>
            <Text className="">
              สร้างและปฏิบัติตามนโยบายความปลอดภัยที่ชัดเจน,
              รวมถึงการตรวจสอบความปลอดภัยในทางระบบและวิศวกรรม.
            </Text>

            <Text className="mt-3" color="black">
              8.การตรวจสอบและบันทึกกิจกรรม
            </Text>
            <Text className="">
              ติดตามและบันทึกกิจกรรมในระบบเพื่อตรวจสอบความปลอดภัยและการตรวจสอบการเข้าใช้งานที่ไม่ถูกต้อง.
            </Text>

            <Text className="mt-3" color="black">
              การปฏิบัติขั้นพื้นฐานเหล่านี้สามารถช่วยป้องกันปัญหาความปลอดภัยในการจัดเก็บและใช้ข้อมูล
            </Text>
            <Text className="mt-3" color="black">
              แต่ควรรักษาการตรวจสอบและปรับปรุงระบบความปลอดภัยอย่างสม่ำเสมอเพื่อเข้ากับการเปลี่ยนแปลงทางเทคโนโลยีและความยากลำบากที่มีในการ
              รักษาความปลอดภัย
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              การเข้าถึงข้อมูล
            </Text>

            <Text>
              การเข้าถึงข้อมูลเป็นกระบวนการที่ต้องดูแลและควบคุมอย่างรอบคอบเพื่อปกป้องข้อมูลที่มีความสำคัญ
              นี่คือบางประการที่สำคัญในการควบคุมการเข้าถึงข้อมูล
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.การตรวจสอบและจัดการสิทธิ์
            </Text>
            <Text className="">
              ตรวจสอบและกำหนดสิทธิ์การเข้าถึงข้อมูลในระบบ
              โดยให้สิทธิ์ที่เหมาะสมกับบทบาทและความรับผิดชอบของผู้ใช้.
            </Text>

            <Text className="mt-3" color="black">
              2.การให้สิทธิ์การเข้าถึงโดยปฏิบัติกรณี
            </Text>
            <Text className="">
              จัดการสิทธิ์การเข้าถึงข้อมูลโดยให้สิทธิ์เฉพาะเมื่อจำเป็น
              และถูกต้องตามความต้องการของผู้ใช้.
            </Text>

            <Text className="mt-3" color="black">
              3.การเข้ารหัสข้อมูล
            </Text>
            <Text className="">
              ใช้เทคนิคการเข้ารหัสข้อมูลเพื่อป้องกันการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต.
            </Text>

            <Text className="mt-3" color="black">
              4.การตรวจสอบการเข้าถึง
            </Text>
            <Text className="">
              ติดตามและบันทึกการเข้าถึงข้อมูลเพื่อตรวจสอบความปลอดภัยและตรวจสอบการเข้าถึงที่ไม่ได้รับอนุญาต.
            </Text>

            <Text className="mt-3" color="black">
              5.การบริหารจัดการข้อมูลส่วนบุคคล
            </Text>
            <Text className="">
              ปฏิบัติตามกฎหมายความเป็นส่วนตัวและการจัดการข้อมูลส่วนบุคคลของผู้ใช้.
            </Text>

            <Text className="mt-3" color="black">
              6.การบริหารจัดการการเข้าถึงจากระยะไกล
            </Text>
            <Text className="">
              ให้ความสำคัญกับการควบคุมการเข้าถึงข้อมูลจากระยะไกลและใช้มาตรการรักษาความปลอดภัยอย่างเหมาะสม.
            </Text>

            <Text className="mt-3" color="black">
              7.การประเมินความเสี่ยง
            </Text>
            <Text className="">
              ประเมินความเสี่ยงที่เกี่ยวข้องกับการเข้าถึงข้อมูลและพัฒนามาตรการรักษาความปลอดภัยตาม.
            </Text>

            <Text className="mt-3" color="black">
              8.การฝึกฝนและการตรวจสอบ
            </Text>
            <Text className="">
              ฝึกฝนพนักงานเพื่อให้เข้าใจและปฏิบัติตามนโยบายความปลอดภัย,
              และตรวจสอบระบบเพื่อค้นหาช่องโหว่.
            </Text>

            <Text className="mt-3" color="black">
              การควบคุมการเข้าถึงข้อมูลเหล่านี้ช่วยให้แน่ใจว่าข้อมูลสามารถเข้าถึงได้โดยเฉพาะโดยผู้ที่มีสิทธิ์และช่วยป้องกันการเข้าถึงที่ไม่ได้รับอนุญาต
              ที่อาจเกิดขึ้นได้อย่างมีประสิทธิภาพ
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              การเก็บรักษาข้อมูล
            </Text>

            <Text>
              การกำหนดระยะเวลาในการเก็บรักษาข้อมูลต้องคำนึงถึงลักษณะของข้อมูลและความเหมาะสมต่อการให้บริการของแพลตฟอร์ม
              นอกจากนี้, ยังต้องเป็นไปตามกฎหมายและนโยบายความเป็นส่วนตัวของบริษัท
              ดังนั้น, ขอให้พิจารณาต่อไปนี้
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.ข้อมูลส่วนบุคคล
            </Text>
            <Text className="">
              บันทึกข้อมูลทั่วไปควรเก็บรักษาได้เป็นระยะเวลาไม่เกิน 2
              ปีหลังจากที่ผู้ใช้งานไม่ใช้บริการหรือบัญชีผู้ใช้งานถูกปิด
            </Text>

            <Text className="mt-3" color="black">
              2.ข้อมูลการใช้งาน
            </Text>
            <Text className="">
              บันทึกข้อมูลการใช้งานควรเก็บรักษาได้เป็นระยะเวลาไม่เกิน 2 ปี,
              โดยจะพิจารณาการปรับปรุงตามความต้องการของแพลตฟอร์ม
            </Text>

            <Text className="mt-3" color="black">
              3.ข้อมูลการชำระเงิน
            </Text>
            <Text className="">
              ข้อมูลการชำระเงินควรถูกเก็บรักษาอย่างปลอดภัยตามกฎหมายที่เกี่ยวข้อง,
              และควรไม่เก็บรักษานานเกินความจำเป็น
            </Text>

            <Text className="mt-3" color="black">
              4.ข้อมูลที่ทำให้ระบุตัวตน
            </Text>
            <Text className="">
              ข้อมูลที่ทำให้ระบุตัวตนควรถูกเก็บรักษาตามความจำเป็นและไม่นานเกินไป
            </Text>

            <Text className="mt-3" color="black">
              5.ข้อมูลการเข้าถึง
            </Text>
            <Text className="">
              บันทึกข้อมูลการเข้าถึงควรเก็บรักษาได้เป็นระยะเวลาไม่เกิน 1 ปี,
              นอกจากจะมีความจำเป็นในการวิเคราะห์ข้อมูลสำหรับการปรับปรุงแพลตฟอร์ม.
            </Text>

            <Text className="mt-3" color="black">
              6.ข้อมูลติดตามและคุกกี้
            </Text>
            <Text className="">
              ข้อมูลติดตามและคุกกี้ควรเก็บรักษาตามนโยบายคุ้มครองส่วนบุคคลและนโยบายคุ้มครองความเป็นส่วนตัวของแพลตฟอร์ม
            </Text>

            <Text className="mt-3" color="black">
              7.ข้อมูลการตลาดและโฆษณา
            </Text>
            <Text className="">
              ข้อมูลการตลาดและโฆษณาควรถูกเก็บรักษาตามความจำเป็นและนโยบายความเป็นส่วนตัว.
            </Text>

            <Text className="mt-3" color="black">
              8.ข้อมูลการสนับสนุน
            </Text>
            <Text className="">
              ข้อมูลการสนับสนุนควรถูกเก็บรักษาตามความจำเป็นในการช่วยเหลือและแก้ไขปัญหา
            </Text>

            <Text className="mt-3" color="black">
              9.ข้อมูลการเปิดเผย
            </Text>
            <Text className="">
              ถ้ามีการเปิดเผยข้อมูลต่อบุคคลภายนอก,
              ควรมีนโยบายชัดเจนและมีมาตรการความปลอดภัยที่เพียงพอ.
            </Text>

            <Text className="mt-3" color="black">
              10.ข้อมูลการปฏิเสธ
            </Text>
            <Text className="">
              มีการให้ผู้ใช้งานสามารถปฏิเสธการเก็บข้อมูลหรือปรับแก้การตั้งค่าความเป็นส่วนตัวได้ตลอดเวลา
            </Text>

            <Text className="mt-3" color="black">
              การกำหนดระยะเวลาในการเก็บรักษาข้อมูลควรมีการรับรองว่ามีการปฏิบัติตามกฎหมายคุ้มครองส่วนบุคคลและมีมาตรการความปลอดภัยที่เพียงพอ
              เพื่อปกป้องข้อมูลของผู้ใช้งาน
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              การเปิดเผยข้อมูล
            </Text>

            <Text>
              การเปิดเผยข้อมูลต่าง ๆ
              ของแพลตฟอร์มของคุณจะมีตามนโยบายความเป็นส่วนตัวและนโยบายการให้บริการของคุณ
              ต่อไปนี้คือกรณีฉุกเฉินหรือสถานการณ์ที่จำเป็นที่จะต้องเปิดเผยข้อมูล
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.ข้อมูลส่วนบุคคล
            </Text>
            <Text className="">
              - กรณีฉุกเฉิน ในกรณีฉุกเฉินทางการแพทย์หรือสาธารณภัย,
              การเปิดเผยข้อมูลส่วนบุคคลเพื่อการรักษาหรือประสานงานสาธารณสุข
            </Text>

            <Text className="mt-3" color="black">
              2.ข้อมูลการใช้งาน
            </Text>
            <Text className="">
              - กรณีปรับปรุงระบบ
              เมื่อมีการปรับปรุงระบบหรือการดำเนินการที่จำเป็นสำหรับการบริการ
            </Text>

            <Text className="mt-3" color="black">
              3.ข้อมูลที่ทำให้ระบุตัวตน
            </Text>
            <Text className="">
              - การปฏิบัติตามกฎหมาย
              การเปิดเผยข้อมูลที่ทำให้ระบุตัวตนตามกฎหมายหรือข้อกำหนดทางกฎหมาย
            </Text>

            <Text className="mt-3" color="black">
              4.ข้อมูลการเข้าถึง
            </Text>
            <Text className="">
              - ความผิดปกติทางความปลอดภัย
              เมื่อมีความผิดปกติทางความปลอดภัยที่ต้องการตรวจสอบหรือแก้ไข
            </Text>

            <Text className="mt-3" color="black">
              5.ข้อมูลติดตามและคุกกี้
            </Text>
            <Text className="">
              - การปรับปรุงประสิทธิภาพ
              เมื่อมีการปรับปรุงคุณภาพของบริการหรือประสบการณ์ผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              6.ข้อมูลการตลาดและโฆษณา
            </Text>
            <Text className="">
              - ข้อตกลงการโฆษณา
              การเปิดเผยข้อมูลตลาดเมื่อมีการประชุมหรือข้อตกลงการโฆษณาที่ผู้ใช้เข้าร่วม
            </Text>

            <Text className="mt-3" color="black">
              7.ข้อมูลการสนับสนุน
            </Text>
            <Text className="">
              - การช่วยเหลือ
              เปิดเผยข้อมูลที่เกี่ยวข้องกับการช่วยเหลือและแก้ไขปัญหาของผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              8.ข้อมูลการเปิดเผย
            </Text>
            <Text className="">
              - ข้อตกลงและสิทธิประโยชน์
              เมื่อมีข้อตกลงหรือสิทธิประโยชน์ที่เกี่ยวข้องกับการเปิดเผยข้อมูล
            </Text>

            <Text className="mt-3" color="black">
              9.ข้อมูลการปฏิเสธ
            </Text>
            <Text className="">
              - ความเป็นส่วนตัว
              การเปิดเผยข้อมูลเพื่อรองรับการปฏิเสธหรือการปรับแก้การตั้งค่าความเป็นส่วนตัวของผู้ใช้
            </Text>

            <Text className="mt-3" color="black">
              โปรดระวังและปฏิบัติตามข้อกำหนดของนโยบายความเป็นส่วนตัวของคุณเสมอ
              และแจ้งให้ทราบผู้ใช้ในกรณีที่มีการเปิดเผยข้อมูลในสถานการณ์ที่ไม่ธรรมดาหรือกรณีฉุกเฉิน
            </Text>
          </div>

          <div className="mt-10 flex flex-col space-y-4  ">
            <Text fontSize="large" as="b" color="black">
              สิทธิของผู้ใช้งาน
            </Text>

            <Text>
              สิทธิของผู้ใช้งานในแพลตฟอร์มของเราควรถูกกำหนดเพื่อให้ผู้ใช้ได้สนุกและมีประสบการณ์ที่เต็มที่
              ดังนั้นเราควรมีสิทธิ์ต่อตนเองในด้านต่าง ๆ ดังนี้
            </Text>

            <Text className="mb-3 mt-3" color="black">
              1.การโพสและแชท
            </Text>
            <Text className="">
              ผู้ใช้ควรมีสิทธิ์ในการโพสต์เนื้อหา, รูปภาพ, และวิดีโอบนแพลตฟอร์ม
              <br />
              มีสิทธิ์ในการแชทกับผู้ใช้งานอื่น ๆ
            </Text>

            <Text className="mt-3" color="black">
              2.การเขียนบล็อก
            </Text>
            <Text className="">
              ผู้ใช้ควรมีสิทธิ์ในการเขียนและแก้ไขบล็อกของตนเอง <br />
              มีสิทธิ์ในการเขียนเนื้อหาที่เกี่ยวข้องกับความสนใจของตน
            </Text>

            <Text className="mt-3" color="black">
              3. การสร้างกิจกรรม (Activity)
            </Text>
            <Text className="">
              ผู้ใช้ควรสามารถสร้างกิจกรรมหรืออีเวนท์ที่เกี่ยวข้องกับชุมชน <br />
              มีสิทธิ์ในการเข้าร่วมกิจกรรมที่ถูกสร้างขึ้น
            </Text>

            <Text className="mt-3" color="black">
              4.การปรับแต่งโปรไฟล์
            </Text>
            <Text className="">
              ผู้ใช้ควรมีสิทธิ์ในการปรับแต่งโปรไฟล์ของตนเอง
              <br />
              มีสิทธิ์ในการเลือกรูปภาพหรือข้อมูลส่วนตัวที่ต้องการแสดง
            </Text>

            <Text className="mt-3" color="black">
              5.การแสดงความคิดเห็น
            </Text>
            <Text className="">
              ผู้ใช้ควรมีสิทธิ์ในการแสดงความคิดเห็นในโพสต์หรือบล็อก
              <br />
              มีสิทธิ์ในการตอบกลับหรือสนทนากับความคิดเห็นของผู้ใช้งานอื่น
            </Text>

            <Text className="mt-3" color="black">
              6.สิทธิในการปรับแต่งโปรไฟล
            </Text>
            <Text className="">สิทธิ์ในการปรับแต่งโปรไฟล์ส่วนบุคคล</Text>

            <Text className="mt-3" color="black">
              7.สิทธิในการโพสท์และแบ่งปัน
            </Text>
            <Text className="">
              สิทธิ์ในการกำหนดระดับความเป็นส่วนตัวของเนื้อหาที่โพสต์ <br />
              สิทธิ์ในการกำหนดใครมีสิทธิ์เข้าถึงหรือแชร์ข้อมูลที่ผู้ใช้โพสต์
            </Text>

            <Text className="mt-3" color="black">
              8.สิทธิในการร้องเรียนและรายงาน
            </Text>
            <Text className="">
              สิทธิ์ในการรายงานเนื้อหาไม่เหมาะสมหรือผิดกฎ <br />
              สิทธิ์ในการยื่นคำร้องเรียนในกรณีที่ตนเองได้รับความเดือดร้อน
            </Text>

            <Text className="mt-3" color="black">
              9.สิทธิ์ในการควบคุมการแจ้งเตือน
            </Text>
            <Text className="">
              สิทธิ์ในการเลือกปรับตั้งค่าการแจ้งเตือนที่จะได้รับ
            </Text>

            <Text className="mt-3" color="black">
              10. สิทธิ์ในการเลือกไม่ให้ข้อมูลถูกนำไปใช้ในการตลาด
            </Text>
            <Text className="">
              สิทธิ์ในการเลือกที่จะไม่ให้ข้อมูลส่วนบุคคลถูกใช้ในกิจกรรมทางการตลาด
            </Text>

            <Text className="mt-3" color="black">
              11. สิทธิ์ในการย้ายข้อมูล
            </Text>
            <Text className="">
              สิทธิ์ในการร้องขอหรือย้ายข้อมูลส่วนบุคคลไปยังแพลตฟอร์มหรือบริการอื่น
            </Text>

            <Text className="mt-3" color="black">
              12. สิทธิ์ในการถอนความยินยอม
            </Text>
            <Text className="">
              สิทธิ์ในการถอนความยินยอมในการใช้ข้อมูลส่วนบุคคลของตน
            </Text>

            <Text className="mt-3" color="black">
              13.
              สิทธิ์ในการเลือกไม่ให้ข้อมูลถูกใช้ในการวิเคราะห์และตัดสินใจอัตโนมัติ
            </Text>
            <Text className="">
              สิทธิ์ในการปฏิเสธการให้ข้อมูลถูกใช้ในการวิเคราะห์ข้อมูลหรือการตัดสินใจที่ใช้เทคโนโลยีอัตโนมัติ
            </Text>

            <Text className="mt-3" color="black">
              14. สิทธิ์ในการแก้ไขข้อมูลการให้ความยินยอม
            </Text>
            <Text className="">
              สิทธิ์ในการแก้ไขข้อมูลที่เกี่ยวกับความยินยอมในการใช้ข้อมูล
            </Text>

            <Text className="mt-3" color="black">
              15. สิทธิ์ในการใช้คุกกี้และเทคโนโลยีติดตาม
            </Text>
            <Text className="">
              สิทธิ์ในการควบคุมการใช้คุกกี้และเทคโนโลยีติดตามข้อมูลการใช้งาน
            </Text>

            <Text className="mt-3" color="black">
              สิทธิ์เหล่านี้ควรเป็นเครื่องมือที่ผู้ใช้งานสามารถใช้เพื่อการสร้างสรรค์และสนุกสนานในแพลตฟอร์มของเรา
              นอกจากนี้,
              สิทธิ์เหล่านี้ควรถูกจัดทำในรูปแบบที่เข้าใจง่ายและสอดคล้องกับหลักการความเป็นส่วนตัว
              ซึ่งผู้ใช้ควรมีสิทธิ์ในการควบคุมข้อมูลส่วนบุคคลของตนเอง
              รวมถึงการตั้งค่าความเป็นส่วนตัวและการตั้งค่าการแชร์ข้อมูล
              โดยที่การให้ความยินยอมจะต้องเป็นอย่างชัดเจนและเสมอภาพ
              ซึ่งเป็นสิ่งที่เราควรเน้นในนโยบายส่วนตัวของเราด้วย
            </Text>
          </div>
          <Divider className="my-1 mt-10 w-[1200px] ring-0 ring-black " />
        </div>
      </div>
    </div>
  )
}
